Revit 2024 API
ApplicationEntryPoint Methods
The ApplicationEntryPoint type exposes the following members.
Methods
Name | Description
CanPostCommand
 Identifies if the given command can be posted, using PostCommand(RevitCommandId).
 (Inherited from UIApplication.)
CreateAddInCommandBinding
Creates a new AddInCommandBinding.
 (Inherited from UIApplication.)
CreateRibbonPanel(String) |  (Overrides UIApplication.CreateRibbonPanel(String).)
CreateRibbonPanel(String, String) |  (Overrides UIApplication.CreateRibbonPanel(String, String).)
CreateRibbonPanel(Tab, String) |  (Overrides UIApplication.CreateRibbonPanel(Tab, String).)
CreateRibbonTab |  (Overrides UIApplication.CreateRibbonTab(String).)
Dispose |  (Inherited from UIApplication.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
FinishInitializationEO
 For Revit Macros internal use only.
GetDockablePane
Gets a DockablePane object by its ID.
 (Inherited from UIApplication.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetRibbonPanels() |  (Overrides UIApplication.GetRibbonPanels().)
GetRibbonPanels(String) |  (Overrides UIApplication.GetRibbonPanels(String).)
GetRibbonPanels(Tab) |  (Overrides UIApplication.GetRibbonPanels(Tab).)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Initialize
 For Revit Macros internal use only.
LoadAddIn
Loads add-ins from the given manifest file.
 (Inherited from UIApplication.)
LoadPackageContents
Loads add-ins from the given packageContents.xml file.
 (Inherited from UIApplication.)
OnShutdownEO
 For Revit Macros internal use only.
OpenAndActivateDocument(String)
 Opens and activates a Revit document.
 (Inherited from UIApplication.)
OpenAndActivateDocument(ModelPath, OpenOptions, Boolean)
 Opens and activates a Revit document, include both local document or cloud document.
 (Inherited from UIApplication.)
OpenAndActivateDocument(ModelPath, OpenOptions, Boolean, IOpenFromCloudCallback)
 Opens and activates a Revit document, include both local document or cloud document.
 (Inherited from UIApplication.)
PostCommand
 Posts the command to the Revit message queue to be invoked when control returns from the current API context.
 (Inherited from UIApplication.)
RegisterDockablePane
Adds a new dockable pane to the Revit user interface.
 (Inherited from UIApplication.)
RemoveAddInCommandBinding
Removes an AddInCommandBinding.
 (Inherited from UIApplication.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ApplicationEntryPoint Class
Autodesk.Revit.UI.Macros Namespace